In [2]:
import numpy as np
import pandas as pd

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [3]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [4]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [5]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [6]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [7]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [8]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [9]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [10]:
frame2["debt"]  = 16.5

In [11]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [12]:
frame2["debt"] = np.arange(6.)

In [13]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [14]:
frame2['eastern'] = frame2.state == 'Ohio'

In [15]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [16]:
a, b = 0, 1
while b < 2000000:
    print(b, end = ' ')
    a, b = b, a + b

1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269

In [17]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [18]:
frame3 = pd. DataFrame(populations)

In [19]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [20]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [21]:
a, b = 0, 1
while b < 2000000:
    print(b, end = ' ')
    a, b = b, a + b

1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269

In [22]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [23]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [24]:
frame3.index.name = "year"; frame3.columns.name = "state"

In [25]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [26]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [27]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [28]:
"Ohio" in frame3.columns

True

In [29]:
frame3.index

Index([2000, 2001, 2002], dtype='int64', name='year')

In [30]:
obj = pd.Series(range(3), index=["a", "b", "c"])

In [31]:
obj

a    0
b    1
c    2
dtype: int64

In [32]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [33]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [34]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [35]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [36]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=[0, 1, 2, 3])

In [37]:
obj

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [38]:
obj.T

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [39]:
obj.abs()

0    4.5
1    7.2
2    5.3
3    3.6
dtype: float64

In [40]:
obj.sort_values()

2   -5.3
3    3.6
0    4.5
1    7.2
dtype: float64

In [41]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [42]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [43]:
obj.index.is_unique

False

In [44]:
obj["a"]

a    0
a    1
dtype: int64

In [45]:
df = pd.DataFrame(np.random.randn(4, 3), index=["a", "a", "b", "b"])

In [46]:
df

          0         1         2
a -0.945872  1.272796 -0.030714
a -0.708726 -0.235804  1.549227
b  0.049068  0.548115 -0.640668
b  0.756147 -1.056278 -0.288368

In [47]:
df.loc["b"]

          0         1         2
b  0.049068  0.548115 -0.640668
b  0.756147 -1.056278 -0.288368

In [48]:
df.loc["a"]

          0         1         2
a -0.945872  1.272796 -0.030714
a -0.708726 -0.235804  1.549227

In [49]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), index=["a", "a", "b", "b", "c"])

In [50]:
df

          0         1         2
a -0.738934  0.643236 -0.714674
a -1.072022  0.778454 -0.742766
b  0.531403 -1.214667  0.990544
b -1.252311  0.611919  0.081988
c -0.046966  0.748769 -0.019043

In [51]:
df.loc["b"]

          0         1         2
b  0.531403 -1.214667  0.990544
b -1.252311  0.611919  0.081988

In [52]:
df.loc["c"]

0   -0.046966
1    0.748769
2   -0.019043
Name: c, dtype: float64

In [53]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=["a", "b", "c", "d"], columns=["one", "two"])

In [54]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [55]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [56]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [57]:
df.sum(axis="rows")

one    9.25
two   -5.80
dtype: float64

In [58]:
df.sum(axis="index")

one    9.25
two   -5.80
dtype: float64

In [59]:
data  = pd.DataFrame({"Ohio": [0, 0, 0, 0], "Colorado": [0, 5, 6, 7], "Utah": [8, 9, 10, 11], "New York": [12, 13, 14, 15]})

In [60]:
data

   Ohio  Colorado  Utah  New York
0     0         0     8        12
1     0         5     9        13
2     0         6    10        14
3     0         7    11        15

In [61]:
data1 = data.T

In [62]:
data1

           0   1   2   3
Ohio       0   0   0   0
Colorado   0   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

In [63]:
data1.columns = ["one", "two", "three", "four"]

In [64]:
data1

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [65]:
data1.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [66]:
data1.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15